app/views/users/_inventories.html.erb

SELECT "inspections".* FROM "inspections" WHERE "inspections"."user_id" = $1 ORDER BY inspection_date DESC  [["user_id", 1]]
---
<ul class="list-group">
  <% @user.inspections.each do |i| %>