app/views/users/_purchase_inventory.html.erb

    			<%= fields_for :pricing do |sub| %>
    				<%= sub.select :plan_id, Plan.all.collect{|x| ["#{x.description} - #{number_to_currency(x.price, precision: 0)}", x.plan_id]}, {}, { id: "plan-select", class: "form-control" }  %>
---
SELECT "plans".* FROM "plans"

    			<%= fields_for :area do |area| %>
    				<%= area.select :area_id, Area.all.collect{|x| [x.name, x.id]}, { include_blank: "-- Select Coverage Area --" }, { class: "form-control" }  %>
---
SELECT "areas".* FROM "areas"