app/controllers/addresses_controller.rb

UPDATE "addresses" SET "street1" = $1, "city" = $2, "state" = $3, "zip" = $4, "updated_at" = $5 WHERE "addresses"."id" = 2  [["street1", "819 Norway Court"], ["city", "Payson"], ["state", "Utah"], ["zip", "84651"], ["updated_at", Sat, 26 Jul 2014 21:36:38 UTC +00:00]]
---
  def update
    if @address.update(address_params)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", "2"]]
---
    def set_address
      @address = Address.find(params[:id])