app/controllers/braintree_controller.rb

UPDATE "addresses" SET "street1" = $1, "city" = $2, "state" = $3, "zip" = $4, "updated_at" = $5 WHERE "addresses"."id" = 1  [["street1", "819 Norway Court"], ["city", "Payson"], ["state", "Utah"], ["zip", "84651"], ["updated_at", Sat, 26 Jul 2014 20:34:43 UTC +00:00]]
INSERT INTO "inspections" ("completed_by", "created_at", "details", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "inspections" SET "status" = $1, "updated_at" = $2, "details" = $3 WHERE "inspections"."id" = 1  [["status", "pending"], ["updated_at", Sat, 26 Jul 2014 20:34:43 UTC +00:00], ["details", "--- {}\n"]]
SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "addresses" ("addressable_id", "addressable_type", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["addressable_id", 1], ["addressable_type", "Inspection"], ["country", "USA"], ["created_at", Sat, 26 Jul 2014 20:34:43 UTC +00:00], ["updated_at", Sat, 26 Jul 2014 20:34:43 UTC +00:00]]
INSERT INTO "inspected_rooms" ("created_at", "inspection_id", "name", "room_type", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 26 Jul 2014 20:34:43 UTC +00:00], ["inspection_id", 1], ["name", "Living Room"], ["room_type", "living_room"], ["updated_at", Sat, 26 Jul 2014 20:34:43 UTC +00:00]]
---
  def submit_transaction
    if params[:pricing][:plan_id] == 'self'
      params[:transaction][:amount] = '250.00'
    else
      params[:transaction][:amount] = '495.00'
    end
    transaction = BraintreeRails::Transaction.create(params[:transaction])
    if transaction.errors.any?
      render transaction.errors.messages.to_json
    else
      current_user.address.update_from_braintree(params[:transaction][:billing])
      inventory = @user.inspections.create!(name:'My Inventory',completed_by:params[:pricing][:plan_id])
      if inventory.completed_by == 'agent'
        inventory.update_attributes(status:'pending')
      end
      if params[:area] && params[:area][:area_id] && !params[:area][:area_id].blank?
        if area = Area.find(params[:area][:area_id])
          inventory.update_attributes(area_id: area.id)
        end
      end
      inventory.address = @user.address.dup
      inventory.inspected_rooms.create(name: "Living Room", room_type: "living_room")