app/controllers/inspections_controller.rb

  def update
    if @inspection.update(inspection_params)
---
UPDATE "inspections" SET "inspection_date" = $1, "updated_at" = $2, "details" = $3 WHERE "inspections"."id" = 1  [["inspection_date", Sat, 02 Aug 2014], ["updated_at", Sun, 27 Jul 2014 05:21:56 UTC +00:00], ["details", "--- {}\n"]]

    def set_inspection
      @inspection = Inspection.find(params[:id])
---
SELECT "inspections".* FROM "inspections" WHERE "inspections"."id" = $1 ORDER BY inspection_date DESC LIMIT 1  [["id", "12"]]