app/controllers/inspected_features_controller.rb

  def create
    respond_with InspectedFeature.create(inspected_feature_params)
---
INSERT INTO "inspected_features" ("created_at", "inspected_room_id", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 26 Jul 2014 21:29:12 UTC +00:00], ["inspected_room_id", 2], ["name", "TV"], ["updated_at", Sat, 26 Jul 2014 21:29:12 UTC +00:00]]

  def update
    respond_with InspectedFeature.update(params[:id], inspected_feature_params)
---
UPDATE "inspected_features" SET "name" = $1, "created_at" = $2, "updated_at" = $3 WHERE "inspected_features"."id" = 1  [["name", "Stereo"], ["created_at", Wed, 13 Aug 2014 22:38:24 UTC +00:00], ["updated_at", Wed, 13 Aug 2014 22:38:24 UTC +00:00]]