app/controllers/inspected_rooms_controller.rb

  def update
    if @inspected_room.update(inspected_room_params)
---
UPDATE "inspected_rooms" SET "name" = $1, "updated_at" = $2 WHERE "inspected_rooms"."id" = 5  [["name", "Living Roo"], ["updated_at", Wed, 13 Aug 2014 22:54:55 UTC +00:00]]

    def set_inspected_room
      @inspected_room = InspectedRoom.find(params[:id])
---
SELECT "inspected_rooms".* FROM "inspected_rooms" WHERE "inspected_rooms"."id" = $1 LIMIT 1  [["id", "2"]]