app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'jason@jmophoto.com' LIMIT 1
SELECT "inspections".* FROM "inspections" WHERE "inspections"."user_id" = $1 ORDER BY inspection_date DESC  [["user_id", 1]]
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)
    if user && user.authenticate(params[:session][:password])
      sign_in user
      if user.admin?
        redirect_to(admin_path)
      elsif user.agent?
        redirect_to(agent_inspections_path)
      else
        if user.inspections.blank?