app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "addresses" ("addressable_id", "addressable_type", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["addressable_id", 1], ["addressable_type", "User"], ["country", "USA"], ["created_at", Sat, 26 Jul 2014 20:31:25 UTC +00:00], ["updated_at", Sat, 26 Jul 2014 20:31:25 UTC +00:00]]
---
  def create
    @user = User.new(user_params)
    if params[:agent_request].present?
      @user.agent = true
      @user.agent_status = 'pending'
    end
    if @user.save
      @user.create_address

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = 2  [["email", "christine@jmophoto.co"], ["updated_at", Wed, 13 Aug 2014 22:21:57 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)