app/controllers/valuables_controller.rb

  def create
    @valuable = Valuable.new(valuable_params)

    if @valuable.save
---
INSERT INTO "valuables" ("created_at", "inspection_id", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 18 Jul 2014 04:03:38 UTC +00:00], ["inspection_id", 8], ["name", "New Valuable"], ["updated_at", Fri, 18 Jul 2014 04:03:38 UTC +00:00]]